0x01-challenge/blog/app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order('created_at DESC')
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def update
    @post = Post.find(params[:id])

    if @post.update(params[:post].permit(:title, :body, :online))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "online" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["online", "f"], ["updated_at", "2024-02-13 19:37:43.505524"], ["id", 3]]